<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Genaro-somos-todos] Armonia
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/genaro-somos-todos/2005-January/index.html" >
   <LINK REL="made" HREF="mailto:genaro-somos-todos%40lists.berlios.de?Subject=Re%3A%20%5BGenaro-somos-todos%5D%20Armonia&In-Reply-To=%3CBAY103-F30AA51BD53A83255CD7D31CE860%40phx.gbl%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000125.html">
   
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Genaro-somos-todos] Armonia</H1>
    <B>Juan Rodriguez Hortal&#225;</B> 
    <A HREF="mailto:genaro-somos-todos%40lists.berlios.de?Subject=Re%3A%20%5BGenaro-somos-todos%5D%20Armonia&In-Reply-To=%3CBAY103-F30AA51BD53A83255CD7D31CE860%40phx.gbl%3E"
       TITLE="[Genaro-somos-todos] Armonia">bc24us at hotmail.com
       </A><BR>
    <I>Tue Jan 25 21:21:11 CET 2005</I>
    <P><UL>
        <LI>Previous message: <A HREF="000125.html">[Genaro-somos-todos] Armonia
</A></li>
        
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#126">[ date ]</a>
              <a href="thread.html#126">[ thread ]</a>
              <a href="subject.html#126">[ subject ]</a>
              <a href="author.html#126">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Para responderte apropiadamente a estas cuestiones lo mejor ser&#237;a que 
quedaramos en persona una tarde o las que fueran pero ahora estoy muy liado 
con los ex&#225;menes y adem&#225;s tendr&#237;a q empollarme el tema a fondo. No te creas 
q yo controlo los modos griegos, se como suenan y de oido los identifico e 
incluso a veces compongo en un modo pero no se la teoria para montar una 
progresion en un modo. Uno de los motivos por los q me mola este proyecto es 
precisamente para llenar mis lagunas en teor&#237;a musical, libros hay por todas 
partes pero si quieres te ayudar&#233; ya q estoy m&#225;s puesto en la terminolog&#237;a. 
Lo que yo creo saber es lo siguiente: sabes que la escala de C Jonico tiene 
las mismas notas que D dorico, E frigio, F lidio, G mixolidio, A eolico y B 
locrio, la difrencia est&#225; en cual es la nota de la escala a la que se le da 
m&#225;s enfasis. Si tu tocas una sola nota aislada ,por ejemplo un do, no estas 
definiendo ning&#250;n contexto arm&#243;nico, pero si tocas un do sobre un acorde de 
C no se oye el mismo efecto que si lo tocas sobre un acorde de G o sobre un 
Em pq ese do crea intervalos distintos con las notas del acorde. Esto 
tambi&#233;n lo puedes hacer, aunque es m&#225;s dificil, sin tocar acordes, haciendo 
una melod&#237;a, pq a una nota le han precedido otras que han creado una cierta 
expectativa de a donde va la sucesion de notas total (que podemos llamar 
linea mel&#243;dica, consideremosla monofonica por ahora). De una manera basta en 
C j&#243;nico la nota de referencia sobre la que giran las dem&#225;s es el do, y en D 
dorico es el re,pero de una manera distinta a como hace de referencia en D 
Jonico,  esa es la diferencia. Lo puedes probar de esta manera, en el piano 
toca todo el rato un do (una sola nota, no el acorde) a negras en la parte 
grave y haz una linea melodica con la mano derecha en la parte aguda usando 
la escala de Do mayor (es decir, solo teclas blancas) . Ahora toca en la 
parte grave un re a negras y haz la misma linea , ver&#225;s que el efecto es 
distinto pq el contexto arm&#243;nico es distinto, aunque toques la misma melod&#237;a

Pq la mayor parte de la musica est&#225; escrita en J&#243;nico ?, pues por costumbre, 
y como desde la infancia llevamos oyendo ese modo es muy f&#225;cil hacer 
progresiones q fijen ese contexto arm&#243;nico. En modo menor se escribe menos 
pero se suele escribir en menor arm&#243;nico no en e&#243;lico, pq como cuenta Enric 
Herrera esta escala se ha modificado para conseguir un quinto grado con 
acorde de dominante (tercera mayor y septima menor) .Pq se busca este V7?, 
pq la cadencia que m&#225;s nos suena por costumbre, cultura y educacion es la 
perfecta, la V7-I , y este V7 ayuda a fijar este contexto arm&#243;nico menor y 
hace que es I del menor arm&#243;nico sea una referencia m&#225;s clara para el resto 
de las notas.Y pq funcionan la cadencias?, simplemente por educacion, en 
otras culturas usan otras escalas y en otros momentos de la historia se han 
usado otras en europa. Otra tipo de armon&#237;a t&#237;pica en la cultura occidental 
actual es la del blues que te explico ahora. La escala b&#225;sica es la 
pentat&#243;nica menor, q como su nombre indica tiene 5 notas que son I, bIII, 
IV, V y bVII, en A ser&#237;a la, do, re, mi, sol, y la progresion t&#237;pica de 
blues es I7-IV7-I7-V7-IV7-I7-V7, en A ser&#237;a I7 = A7, IV7 = D7 y V7 = E7  . 
Sobre esa progresion se usa la pentat&#243;nica menor en todos los acordes, 
fijate que sobre el I7 que es un acorde mayor est&#225;s usando una escala 
menor(de tercera menor)!!!!, y funciona pq llevamos toda la vida 
escuch&#225;ndolo, no hay m&#225;s

Pero volviendo a los modos la m&#250;sica modal lo que suele hacer es alargar lo 
que duran los acordes. Si ves en el libro de Enric Herrera en XXVIII, la 
relacion escala-acorde puedes ver que se usan los modos, mira la tabla de la 
p&#225;gina 101, sobre un acorde de V7 se usa la escala mixolidia, la cosa es 
cambiar de escala cuando se cambia de acorde en la progresion. Esta es una 
forma distinta de pensar que hacer una progresion totalmente diat&#243;nica y 
usar la misma escala para hacer una melodia encima de la progresion. Mira 
este ejemplo sacado de una revista sobre el tema Black Narcissus de Joe 
Henderson. La progresion es , con un acorde por comp&#225;s en 4/4, (Abm7 
Db7/Ab)x4 (Gbm7 Cb7/Gb)x4 (Ebmaj7(#11) Fmaj7(#11) Bbmaj7(11#) Cmaj7)x2
notacion: (acordes)xN, se repite N veces esta serie de acordes
          cif/not es el cifrado del acorde formado por cif al que se le 
a&#241;ade de nota grave la nota not
          cif(#11) es el cifrado del acorde formado por cif al que se le 
a&#241;ade la tensi&#243;n #11 (cuarta aumentada por la zona aguda)
Bueno pues en esta progresion se pueden usar las siguientes escalas:
-compases 1 a 8 (es decir, sobre Abm7 Db7/Ab): Ab dorico. El Ab se ha fijado 
de referencia pq suena como nota grave en los dos acordes. En la escala 
dorica el primer grado tiene de acorde Im7 claro, y en el cuarto tiene IV7 
(como el V grado de la j&#243;nica), en Ab dorico ser&#237;an Im7 = Abmt y IV7 = Db7, 
todo encaja
-compases 9 al 16: Gb dorico pq es como la progresion anterior bajada un 
tono
-compas 17 : Eb lidio mira la tabla del libro de Enric Herrera pag 101, hay 
dos acordes maj7, el del I grado y el del IV grado, pero s&#243;lo el del IV 
admite la tensi&#243;n #11 que este acorde tiene. Y al IV le corresponde la 
escala Lidia. Miralo de esta forma, en la escala de D mayor (jonica) la 
cuarta del primer grado es justa, pero la cuarta del cuarto grado es 
aumentada, y cual es la escala del cuarto grado?: la lidia
-compas 18 : F lidio
-compas 19 : Bb lidio
-compas 20 : C lidio

una progresion modal lo que hace es algo como lo que se hace en los compases 
1 a 8, alargar la influencia del dorico o el modo que sea con trucos como el 
pedal que se usa aqui y otros q desconozco. Y tb depende de la melod&#237;a que 
toques encima, el enf&#225;sis que hagas en una u otra nota. Pero lo q es 
inevitable es que si no conoces un modo, si no te suena, si no lo has 
escuchado, entonces una progresion en ese modo te sonara rara y poco 
musical, por eso el jazz duro no le gusta a alguna gente

Respecto a las cadencias: es una sucesion de acordes que nos lleva a un 
punto de reposo, por tanto es como un punto o una coma en el discurso 
musical
-aut&#233;ntica: V-I
-plagal: subdominante-tonica, por tanto es IV-I, IV-VIm, IV-IIIm, II-I,..
-rota: V-tonica, con t&#243;nica distinto del I
-semicadencia: es el reposo moment&#225;neo en un acorde q no es de t&#243;nica, 
normalmente el de dominante (V7). Esto es una contradiccion pq no se puede 
reposar sobre el acorde m&#225;s inestable que hay, por tanto esta cadencia debe 
ser resuelta para llegar al reposo. Mira el ejemplo del libro, p&#225;gina 78. 
Hace G C G D7 | G C G D7 G, es decir, I IV I V7| I IV I V7 I La semicadencia 
se da en el primer D7, se resuelve cuando este cae en el siguiente G. Se que 
esto no te ha convencido pero bueno...

Espero haberte sido de ayuda y no haber dicho muchas tonter&#237;as, nos vemos 
despu&#233;s de los ex&#225;menes y seguimos con la discursion!!!

&gt;<i>From: &quot;Roberto Torres&quot; &lt;<A HREF="https://lists.berlios.de/mailman/listinfo/genaro-somos-todos">roberto_____666 at hotmail.com</A>&gt;
</I>&gt;<i>To: <A HREF="https://lists.berlios.de/mailman/listinfo/genaro-somos-todos">genaro-somos-todos at lists.berlios.de</A>
</I>&gt;<i>Subject: [Genaro-somos-todos] Armonia
</I>&gt;<i>Date: Mon, 24 Jan 2005 21:35:31 +0000
</I>&gt;<i>
</I>&gt;<i>Esta pregunta va destinada principalmente a Juan, que es el que pilota un 
</I>&gt;<i>poco mas del tema.
</I>&gt;<i>No entiendo lo de los modos griegos. Por lo visto una cancion puede estar 
</I>&gt;<i>en un modo: eolio, jonico, etc. pero diferentes modos tienen las mismas 
</I>&gt;<i>notas. Ej: Do jonico = La eolio. &#191;Como se puede determinar el modo de una 
</I>&gt;<i>cancion? Ademas, &#191;c&#243;mo es que la mayoria de la musica esta escrita en modo 
</I>&gt;<i>Mayor que es el Jonico o el Menor que es el eolio?
</I>&gt;<i>Otra cosa. En el libro habla de la semicadencia pero no la explica 
</I>&gt;<i>absolutamente nada. A parte la plagal tampoco me queda muy clara. Creo que 
</I>&gt;<i>la rota y la autentica mas o menos si. Me la puedes explicar, porfi
</I>&gt;<i>
</I>&gt;<i>_________________________________________________________________
</I>&gt;<i>M&#243;viles, DVD, c&#225;maras digitales, coleccionismo... Con unas ofertas que ni 
</I>&gt;<i>te imaginas. <A HREF="http://www.msn.es/Subastas/">http://www.msn.es/Subastas/</A>
</I>&gt;<i>
</I>&gt;<i>_______________________________________________
</I>&gt;<i>Genaro-somos-todos mailing list
</I>&gt;<i><A HREF="https://lists.berlios.de/mailman/listinfo/genaro-somos-todos">Genaro-somos-todos at lists.berlios.de</A>
</I>&gt;<i><A HREF="http://lists.berlios.de/mailman/listinfo/genaro-somos-todos">http://lists.berlios.de/mailman/listinfo/genaro-somos-todos</A>
</I>
_________________________________________________________________
Hor&#243;scopo, tarot, numerolog&#237;a... Escucha lo que te dicen los astros. 
<A HREF="http://astrocentro.msn.es/">http://astrocentro.msn.es/</A>


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000125.html">[Genaro-somos-todos] Armonia
</A></li>
	
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#126">[ date ]</a>
              <a href="thread.html#126">[ thread ]</a>
              <a href="subject.html#126">[ subject ]</a>
              <a href="author.html#126">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/genaro-somos-todos">More information about the Genaro-somos-todos
mailing list</a><br>
</body></html>
